files/paper-reviews/1.2 Star Cluster.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-15 Tue 13:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChongChong He" />
<link rel="stylesheet" href="css/org.css" type="text/css" />
<link rel="stylesheet" href="css/custom.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01727b5">1. Star Cluster</a>
<ul>
<li><a href="#org9b5fcfc">1.1. Dust</a>
<ul>
<li><a href="#orgf2bd0a1">1.1.1. Gnedin2008</a></li>
<li><a href="#org3242f01">1.1.2. Corrales2016</a></li>
</ul>
</li>
<li><a href="#orgf35df6b">1.2. Supermassive Black Hole Seed</a>
<ul>
<li><a href="#org3f0fca0">1.2.1. Latif:2016</a></li>
<li><a href="#org8f918d0">1.2.2. Portegies-Zwart:1999</a></li>
<li><a href="#orge757d20">1.2.3. Katz:2015</a></li>
<li><a href="#org9c7c5c7">1.2.4. SILCC: chemical evolution</a></li>
</ul>
</li>
<li><a href="#org9665836">1.3. Escape fraction from MC</a>
<ul>
<li><a href="#orga95d7c6">1.3.1. Howard (2017)</a></li>
<li><a href="#orgfe3c62f">1.3.2. [@Howard:2018]}</a></li>
<li><a href="#orgfbbd28d">1.3.3. Howard:2018a</a></li>
<li><a href="#org81a25e6">1.3.4. Kim:2017</a></li>
</ul>
</li>
<li><a href="#orgf95d0eb">1.4. Galactic escape fraction</a>
<ul>
<li><a href="#org4977845">1.4.1. Gnedin:2008</a></li>
<li><a href="#orgb8aea37">1.4.2. Arata:2019</a></li>
<li><a href="#org1d885a3">1.4.3. Ma2015</a></li>
</ul>
</li>
<li><a href="#org0225416">1.5. Stellar radiation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="HTML" id="org8e96679">
<p>
\(
	  \newcommand{\dif}{\,\mathrm{d}}
	  \newcommand{\sci}[2]{#1 \times 10^{#2}}
	  \def\num#1{\numx#1}\def\numx#1e#2{{#1}\mathrm{e}{#2}}
	  \newcommand{\msun}{{\rm M}_\odot}
	  \newcommand{\si}[1]{{\rm #1}}
\)
</p>

</div>


<div id="outline-container-org01727b5" class="outline-2">
<h2 id="org01727b5"><span class="section-number-2">1</span> Star Cluster</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9b5fcfc" class="outline-3">
<h3 id="org9b5fcfc"><span class="section-number-3">1.1</span> Dust</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf2bd0a1" class="outline-4">
<h4 id="orgf2bd0a1"><span class="section-number-4">1.1.1</span> Gnedin2008</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Table 1 provides parameters for the dust extinction law fits. Assume
\(N_H\) is gas column density (as opposed to hydrogen column density).
</p>
</div>
</div>

<div id="outline-container-org3242f01" class="outline-4">
<h4 id="org3242f01"><span class="section-number-4">1.1.2</span> Corrales2016</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This paper cited [@Draine2003], but actually using data from both
[@Weingartner2001] and <span class="underline">Draine2003</span>, as the latter extends the spectrum
to X-ray, which is the focus of this paper.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf35df6b" class="outline-3">
<h3 id="orgf35df6b"><span class="section-number-3">1.2</span> Supermassive Black Hole Seed</h3>
<div class="outline-text-3" id="text-1-2">
<p>
From <a href="https://arxiv.org/abs/1812.08892">https://arxiv.org/abs/1812.08892</a>: Due to the theory of
primordial star formation and the observed first chemical enrichment,
the most likely candidates for seed black holes (Volonteri 2010; Latif
\&amp; Ferrara 2016) are the remnants of Population iii stars (Madau \&amp; Rees
2001; Bromm et al. 2002; Schneider et al. 2002), the direct collapse of
primordial gas (Bromm \&amp; Loeb 2003; Koushiappas et al. 2004; Agarwal et
al. 2012), or via a massive quasi-star formed from collisions in nuclear
star clusters in the early Universe (Baumgarte \&amp; Shapiro 1999;
Portegies Zwart et al. 1999; Devecchi \&amp; Volonteri 2009).
</p>
</div>

<div id="outline-container-org3f0fca0" class="outline-4">
<h4 id="org3f0fca0"><span class="section-number-4">1.2.1</span> Latif:2016</h4>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>BH formation scenarios:

<ul class="org-ul">
<li>core-collapse of massive stars (Ciardi \&amp; Ferrara 2005; Bromm

<ol class="org-ol">
<li></li>
</ol></li>

<li>dynamical evolution of dense nuclear star clusters, (Baumgarte \&amp;
Shapiro 1999; Portegies Zwart et al. 1999; Devecchi \&amp; Volonteri

<ol class="org-ol">
<li></li>
</ol></li>

<li>collapse of a protogalactic metal free gas cloud. Here I focus on
scenario ii.</li>
</ul></li>

<li>Some backgrounds:

<ul class="org-ul">
<li>The earlier studies suggested dense stellar clusters with more than
\(10^7\) stars are required for the run-away collapse to occur (Lee
1987; Quinlan \&amp; Shapiro 1990). Binary heating stops the core
collapse in less massive stellar clusters (Heggie 1975; Hut et
al. 1992). Moreover, the core collapse timescale has to be shorter
than \(\sim 3\) Myr, otherwise mass loss from the supernova may
halt the core collapse.</li>
<li>Mass segregation instability can lead to for mation of BH seed even
in less massive clusters (Spitzer 1969; Vishniac 1978; Begelman \&amp;
Rees 1978), if mass segregation occurs within the first 3 Myr. Need
low metallicity clusters where mass loss from stellar winds is
expected to be minimum (Hirschi 2007; Glebbeek et al. 2009).</li>
<li>merging of many stellar mass BHs or a supra-exponential growth of
stellar mass black holes in a cluster by dense cold gas flows
Alexander \&amp; Natarajan (2014). Will not work, BHs will be thrown
away.</li>
<li>Run-away merging of stellar mass black holes in the core of a dense
cluster mediated by the extremely large inflows of gas (Davies,
Miller, \&amp; Bellovary 2011; Lupi et al. 2014).</li>
</ul></li>

<li>Compact star clusters

<ul class="org-ul">
<li>Collapse timescale has to be shorter than \(\sim 3\)~Myr.</li>
<li>Number of collisions and ther increase in mass per collision
strongly depend on half-mass radius. (Portegies Zwart \&amp; McMillan
2002). The mass of a Very Massive Star (VMS) linearly increases
with the initial central density of a cluster.</li>
<li>At hiehger metallicities, fragmentation occrus at densities at low
as \(10^3 {\rm cm^{-3}}\), resulting in the core collapse time
longer than 3 Myr (Omukai et al. 2008; Devecchi \&amp; Volonteri 2009;
Devecchi et al. 2012).</li>
<li>Large accretion rates and efficient star formation are required for
the formation of such compact nuclear stellar. By performming 3D
cosmological simulations, Latif et al. (2016) find that a dense
cluster may also form for \(Z/Z_{\odot} \ge 10^{-4}\) in the
presence of a strong UV flux.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org8f918d0" class="outline-4">
<h4 id="org8f918d0"><span class="section-number-4">1.2.2</span> Portegies-Zwart:1999</h4>
</div>
<div id="outline-container-orge757d20" class="outline-4">
<h4 id="orge757d20"><span class="section-number-4">1.2.3</span> Katz:2015</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
My summary: Kate:2015 set initial conditions for simulations of an star
cluster with NBODY6 from the gas cloud forming in the core of the
metal-enriched halo from zoom-in simulation of mini-halos. They find
that the mass of the VMS can reach \(>400~\msun\) in clusters with
stellar masses \(\approx 10^4~\msun\) and over \(1000~\msun\) for more
massive and denser cluster.
</p>

<p>
Latif:2016's summary: Katz et al. (2015) used a combination of
hydrodynamical cosmological simulations and direct N-body simulations to
estimate the mass of a VMS forming via stellar run-away collisions in a
metal poor stellar cluster. They found that a VMS of \(\ge 400~\msun\)
can form in a stellar cluster of \(10^4~\msun\) at z = 15 and may reach
up to a \(1000~\msun\) for a cluster mass of a few times \(10^5~\msun\).
</p>

<ol class="org-ol">
<li><p>
Methods
</p>

<p>
Simualte evolusion of a pair of neighboring high-redshift mini-halos
with zoom-in RAMSES simulation. The central nuclear star cluster
(NSC) can be enriched to a critical metallicity, sufficient for Pop.
II star formation at \(z \approx 27\). From the gas cloud forming in
the core of the metal-enriched halo, they set initial conditions for
simulations of an star cluster with NBODY6. The final mass of the VMS
can reach \(>400~\msun\) in clusters with stellar masses
\(\approx 10^4~\msun\) and over \(1000~\msun\) for more massive and
denser cluster.
</p></li>

<li><p>
My concerns
</p>

<p>
Are the initial conditions of the sampled star cluster realistic?
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org9c7c5c7" class="outline-4">
<h4 id="org9c7c5c7"><span class="section-number-4">1.2.4</span> SILCC: chemical evolution</h4>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>On the SILCC project (led by S. C. O. Glover?) (Seifried et al. 2017)
4 chemical convergence criteria are proposed. See logs.org for how my
simulations meet these criteria.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9665836" class="outline-3">
<h3 id="org9665836"><span class="section-number-3">1.3</span> Escape fraction from MC</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orga95d7c6" class="outline-4">
<h4 id="orga95d7c6"><span class="section-number-4">1.3.1</span> Howard (2017)</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li><p>
Initial conditios
</p>

<p>
n = 100 cm-3, corresponding to tff = 4.4 Myr (assuming \(\mu\) =
1.4). Masses = \(10^{4-6}~\msun\).
</p></li>

<li><p>
Method
</p>

<p>
include radiation pressure adopting a single UV opacity.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgfe3c62f" class="outline-4">
<h4 id="orgfe3c62f"><span class="section-number-4">1.3.2</span> [@Howard:2018]}</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
\paragraph{Escape fraction from populations}
</p>

<ul class="org-ul">
<li>Sampling discrete distribution following \(M^\alpha\) and
\(\alpha = -1.5\) or \(-2.5\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgfbbd28d" class="outline-4">
<h4 id="orgfbbd28d"><span class="section-number-4">1.3.3</span> Howard:2018a</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Todo: compare Z dependence.
</p>

<ul class="org-ul">
<li>Star clusters form in filaments and move with the filamentary gas
flows.</li>
<li>Clusters grow by gas inflow from their host filaments and by merging
events.</li>
<li>Forms 229 and 146 {<b>cluster particles</b>}.</li>
<li>Particle merging is allowed.</li>
<li>Lowering Z results in higher \(f_{\rm star}\), contrary to what we
find. A factor of \(\sim 4\) difference due to metallicity difference.
At sub-solar metallicity, the radiation produced by the young stars
exerts less pressure on the surrounding gas because the opacity is
lower, allowing the YMC to continue accreting gas throughout its
entire history.</li>
<li>Subgrid model for star formation: Samping Chabrier IMF with \(20\%\)
efficiency.</li>
<li>Radiative transfer: raytracing scheme. Radiation pressure is included.</li>
</ul>
</div>
</div>

<div id="outline-container-org81a25e6" class="outline-4">
<h4 id="org81a25e6"><span class="section-number-4">1.3.4</span> Kim:2017</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Title: Modeling UV Radiation Feedback from Massive Stars. I.
Implementation of Adaptive Ray-tracing Method and Tests
</p>
</div>
</div>
</div>

<div id="outline-container-orgf95d0eb" class="outline-3">
<h3 id="orgf95d0eb"><span class="section-number-3">1.4</span> Galactic escape fraction</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org4977845" class="outline-4">
<h4 id="org4977845"><span class="section-number-4">1.4.1</span> Gnedin:2008</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Escape fraction of \(1\% - 3\%\) over the entire redshift interval (3
&lt; \(z\) &lt; 9) and veries by more than an order of magnitude along
different lines of sight, for a massive galaxies and SFR
\(\approx 1-5 \ {\rm M_\odot} \ {\rm yr}^{-1}\).
\(\langle f_{\rm esc}\rangle\) declines steeply at lower masses and
SFR. Absorption by dust is considered.</li>
<li>The low values of escape fractions are due to a small fraction of
young stars located just outside the edge of the H i disk. This
fraction is smaller in disks of smaller galaxies.</li>
<li>Alternative method: direct measurements of HI column density at
\(z \sim 3\).</li>
<li><b>Absorption by dust</b> Dust may contribute significantly to the
absorption of ionizing radiation (e.g., Weingartner \&amp; Draine 2001).</li>
<li>Compare with previous work:

<ul class="org-ul">
<li>Siana et al. 2007: Lyman continuum escape fractions in galaxies at
\(z \sim 1\), \(f_{esc} \lesssim 0.1\).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb8aea37" class="outline-4">
<h4 id="orgb8aea37"><span class="section-number-4">1.4.2</span> Arata:2019</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
A number of literatures have examined the escape fraction of UV photons
from galaxies. Using zoom-in initial conditions in cosmological
hydrodynamic simulations, <span class="underline">Arata:2019</span> investigate three massive
galaxies and find the escape fraction of UV photons fluctuates in the
range of 0.2 &#x2013; 0.8 with a time-averaged value of 0.3. They find that
gas and dust are ejected from star-forming regions by supernova
feedback, allowing the UV photons to escape.
</p>
</div>
</div>

<div id="outline-container-org1d885a3" class="outline-4">
<h4 id="org1d885a3"><span class="section-number-4">1.4.3</span> Ma2015</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
[@Ma2015] studied the escape fraction of ionizing photons from
less-massive galaxies with halo mass
\(M_{\rm h} \sim 10^9 - 10^{11} ~\msun\) and showed that
\(f_{\rm esc}^{\rm gal}\) has large time variability and the
time-averaged \(f_{\rm esc}^{\rm gal}\) generally remains \(< \sim 5\)
per cent.
</p>

<div class="org-src-container">
<pre class="src src-latex">  A number of literature have examined the escape fraction of
  UV photons from galaxies, <span style="color: #4078f2;">$f</span><span style="color: #a0bcf8;">_{\rm esc}^{\rm gal}</span><span style="color: #4078f2;">$</span>. <span style="color: #e45649;">\cite</span>{<span style="color: #b751b6;">Ma2015</span>}
  studied the escape fraction of ionizing photons from less-massive
  galaxies with halo mass <span style="color: #4078f2;">$M</span><span style="color: #a0bcf8;">_{\rm h}</span><span style="color: #4078f2;"> </span><span style="color: #4078f2;">\sim</span><span style="color: #4078f2;"> 10</span><span style="color: #a0bcf8;">^9</span><span style="color: #4078f2;"> - 10</span><span style="color: #a0bcf8;">^{11}</span><span style="color: #4078f2;"> ~</span><span style="color: #4078f2;">\msun</span><span style="color: #4078f2;">$</span> and
  showed that <span style="color: #4078f2;">$f</span><span style="color: #a0bcf8;">_{\rm esc}^{\rm gal}</span><span style="color: #4078f2;">$</span> has large time variability and the
  time-averaged <span style="color: #4078f2;">$f</span><span style="color: #a0bcf8;">_{\rm esc}^{\rm gal}</span><span style="color: #4078f2;">$</span> generally remains <span style="color: #4078f2;">$lesssim 5$</span>
  per cent. Using zoom-in initial conditions in cosmological
  hydrodynamic simulations, <span style="color: #e45649;">\cite</span>{<span style="color: #b751b6;">Arata:2019</span>} investigate three massive
  galaxies and find the escape fraction of UV photons fluctuates in the
  range of 20 per cent -- 80 per cent with a time-averaged value of 30
  per cent. They find that gas and dust are ejected from star-forming
  regions by supernova feedback, allowing the UV photons to escape.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0225416" class="outline-3">
<h3 id="org0225416"><span class="section-number-3">1.5</span> Stellar radiation</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Keywords: Vacca function, Schaerer fit
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Author: ChongChong He</p><p></p><p><a href='https://www.astro.umd.edu/~chongchong/'>www.astro.umd.edu/~chongchong/</a></p>
</div>
</body>
</html>